MikroElektronika/core_packages/PIC/XC8/def/PIC18F2580/mcu.h
// Register: RXF8SIDH
#define RXF8SIDH RXF8SIDH
extern volatile unsigned char           RXF8SIDH            __at(0xD68);
#ifndef _LIB_BUILD
asm("RXF8SIDH equ 0D68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF8SID3               :1;
        unsigned RXF8SID4               :1;
        unsigned RXF8SID5               :1;
        unsigned RXF8SID6               :1;
        unsigned RXF8SID7               :1;
        unsigned RXF8SID8               :1;
        unsigned RXF8SID9               :1;
        unsigned RXF8SID10              :1;
    };
} RXF8SIDHbits_t;
extern volatile RXF8SIDHbits_t RXF8SIDHbits __at(0xD68);
// bitfield macros
#define _RXF8SIDH_SID3_POSN                                 0x0
#define _RXF8SIDH_SID3_POSITION                             0x0
#define _RXF8SIDH_SID3_SIZE                                 0x1
#define _RXF8SIDH_SID3_LENGTH                               0x1
#define _RXF8SIDH_SID3_MASK                                 0x1
#define _RXF8SIDH_SID4_POSN                                 0x1
#define _RXF8SIDH_SID4_POSITION                             0x1
#define _RXF8SIDH_SID4_SIZE                                 0x1
#define _RXF8SIDH_SID4_LENGTH                               0x1
#define _RXF8SIDH_SID4_MASK                                 0x2
#define _RXF8SIDH_SID5_POSN                                 0x2
#define _RXF8SIDH_SID5_POSITION                             0x2
#define _RXF8SIDH_SID5_SIZE                                 0x1
#define _RXF8SIDH_SID5_LENGTH                               0x1
#define _RXF8SIDH_SID5_MASK                                 0x4
#define _RXF8SIDH_SID6_POSN                                 0x3
#define _RXF8SIDH_SID6_POSITION                             0x3
#define _RXF8SIDH_SID6_SIZE                                 0x1
#define _RXF8SIDH_SID6_LENGTH                               0x1
#define _RXF8SIDH_SID6_MASK                                 0x8
#define _RXF8SIDH_SID7_POSN                                 0x4
#define _RXF8SIDH_SID7_POSITION                             0x4
#define _RXF8SIDH_SID7_SIZE                                 0x1
#define _RXF8SIDH_SID7_LENGTH                               0x1
#define _RXF8SIDH_SID7_MASK                                 0x10
#define _RXF8SIDH_SID8_POSN                                 0x5
#define _RXF8SIDH_SID8_POSITION                             0x5
#define _RXF8SIDH_SID8_SIZE                                 0x1
#define _RXF8SIDH_SID8_LENGTH                               0x1
#define _RXF8SIDH_SID8_MASK                                 0x20
#define _RXF8SIDH_SID9_POSN                                 0x6
#define _RXF8SIDH_SID9_POSITION                             0x6
#define _RXF8SIDH_SID9_SIZE                                 0x1
#define _RXF8SIDH_SID9_LENGTH                               0x1
#define _RXF8SIDH_SID9_MASK                                 0x40
#define _RXF8SIDH_SID10_POSN                                0x7
#define _RXF8SIDH_SID10_POSITION                            0x7
#define _RXF8SIDH_SID10_SIZE                                0x1
#define _RXF8SIDH_SID10_LENGTH                              0x1
#define _RXF8SIDH_SID10_MASK                                0x80
#define _RXF8SIDH_RXF8SID3_POSN                             0x0
#define _RXF8SIDH_RXF8SID3_POSITION                         0x0
#define _RXF8SIDH_RXF8SID3_SIZE                             0x1
#define _RXF8SIDH_RXF8SID3_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID3_MASK                             0x1
#define _RXF8SIDH_RXF8SID4_POSN                             0x1
#define _RXF8SIDH_RXF8SID4_POSITION                         0x1
#define _RXF8SIDH_RXF8SID4_SIZE                             0x1
#define _RXF8SIDH_RXF8SID4_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID4_MASK                             0x2
#define _RXF8SIDH_RXF8SID5_POSN                             0x2
#define _RXF8SIDH_RXF8SID5_POSITION                         0x2
#define _RXF8SIDH_RXF8SID5_SIZE                             0x1
#define _RXF8SIDH_RXF8SID5_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID5_MASK                             0x4
#define _RXF8SIDH_RXF8SID6_POSN                             0x3
#define _RXF8SIDH_RXF8SID6_POSITION                         0x3
#define _RXF8SIDH_RXF8SID6_SIZE                             0x1
#define _RXF8SIDH_RXF8SID6_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID6_MASK                             0x8
#define _RXF8SIDH_RXF8SID7_POSN                             0x4
#define _RXF8SIDH_RXF8SID7_POSITION                         0x4
#define _RXF8SIDH_RXF8SID7_SIZE                             0x1
#define _RXF8SIDH_RXF8SID7_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID7_MASK                             0x10
#define _RXF8SIDH_RXF8SID8_POSN                             0x5
#define _RXF8SIDH_RXF8SID8_POSITION                         0x5
#define _RXF8SIDH_RXF8SID8_SIZE                             0x1
#define _RXF8SIDH_RXF8SID8_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID8_MASK                             0x20
#define _RXF8SIDH_RXF8SID9_POSN                             0x6
#define _RXF8SIDH_RXF8SID9_POSITION                         0x6
#define _RXF8SIDH_RXF8SID9_SIZE                             0x1
#define _RXF8SIDH_RXF8SID9_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID9_MASK                             0x40
#define _RXF8SIDH_RXF8SID10_POSN                            0x7
#define _RXF8SIDH_RXF8SID10_POSITION                        0x7
#define _RXF8SIDH_RXF8SID10_SIZE                            0x1
#define _RXF8SIDH_RXF8SID10_LENGTH                          0x1
#define _RXF8SIDH_RXF8SID10_MASK                            0x80

