MikroElektronika/core_packages/PIC/XC8/def/PIC18F2580/mcu.h
// Register: B0DLC
#define B0DLC B0DLC
extern volatile unsigned char           B0DLC               __at(0xE25);
#ifndef _LIB_BUILD
asm("B0DLC equ 0E25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR_TXRTR            :1;
    };
    struct {
        unsigned                        :4;
        unsigned RESRB0                 :1;
        unsigned RESRB1                 :1;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned B0DLC0                 :1;
        unsigned B0DLC1                 :1;
        unsigned B0DLC2                 :1;
        unsigned B0DLC3                 :1;
        unsigned B0RB0                  :1;
        unsigned B0RB1                  :1;
        unsigned B0RXRTR                :1;
    };
} B0DLCbits_t;
extern volatile B0DLCbits_t B0DLCbits __at(0xE25);
// bitfield macros
#define _B0DLC_DLC0_POSN                                    0x0
#define _B0DLC_DLC0_POSITION                                0x0
#define _B0DLC_DLC0_SIZE                                    0x1
#define _B0DLC_DLC0_LENGTH                                  0x1
#define _B0DLC_DLC0_MASK                                    0x1
#define _B0DLC_DLC1_POSN                                    0x1
#define _B0DLC_DLC1_POSITION                                0x1
#define _B0DLC_DLC1_SIZE                                    0x1
#define _B0DLC_DLC1_LENGTH                                  0x1
#define _B0DLC_DLC1_MASK                                    0x2
#define _B0DLC_DLC2_POSN                                    0x2
#define _B0DLC_DLC2_POSITION                                0x2
#define _B0DLC_DLC2_SIZE                                    0x1
#define _B0DLC_DLC2_LENGTH                                  0x1
#define _B0DLC_DLC2_MASK                                    0x4
#define _B0DLC_DLC3_POSN                                    0x3
#define _B0DLC_DLC3_POSITION                                0x3
#define _B0DLC_DLC3_SIZE                                    0x1
#define _B0DLC_DLC3_LENGTH                                  0x1
#define _B0DLC_DLC3_MASK                                    0x8
#define _B0DLC_RB0_POSN                                     0x4
#define _B0DLC_RB0_POSITION                                 0x4
#define _B0DLC_RB0_SIZE                                     0x1
#define _B0DLC_RB0_LENGTH                                   0x1
#define _B0DLC_RB0_MASK                                     0x10
#define _B0DLC_RB1_POSN                                     0x5
#define _B0DLC_RB1_POSITION                                 0x5
#define _B0DLC_RB1_SIZE                                     0x1
#define _B0DLC_RB1_LENGTH                                   0x1
#define _B0DLC_RB1_MASK                                     0x20
#define _B0DLC_RXRTR_TXRTR_POSN                             0x6
#define _B0DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B0DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B0DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B0DLC_RXRTR_TXRTR_MASK                             0x40
#define _B0DLC_RESRB0_POSN                                  0x4
#define _B0DLC_RESRB0_POSITION                              0x4
#define _B0DLC_RESRB0_SIZE                                  0x1
#define _B0DLC_RESRB0_LENGTH                                0x1
#define _B0DLC_RESRB0_MASK                                  0x10
#define _B0DLC_RESRB1_POSN                                  0x5
#define _B0DLC_RESRB1_POSITION                              0x5
#define _B0DLC_RESRB1_SIZE                                  0x1
#define _B0DLC_RESRB1_LENGTH                                0x1
#define _B0DLC_RESRB1_MASK                                  0x20
#define _B0DLC_TXRTR_POSN                                   0x6
#define _B0DLC_TXRTR_POSITION                               0x6
#define _B0DLC_TXRTR_SIZE                                   0x1
#define _B0DLC_TXRTR_LENGTH                                 0x1
#define _B0DLC_TXRTR_MASK                                   0x40
#define _B0DLC_RXRTR_POSN                                   0x6
#define _B0DLC_RXRTR_POSITION                               0x6
#define _B0DLC_RXRTR_SIZE                                   0x1
#define _B0DLC_RXRTR_LENGTH                                 0x1
#define _B0DLC_RXRTR_MASK                                   0x40
#define _B0DLC_B0DLC0_POSN                                  0x0
#define _B0DLC_B0DLC0_POSITION                              0x0
#define _B0DLC_B0DLC0_SIZE                                  0x1
#define _B0DLC_B0DLC0_LENGTH                                0x1
#define _B0DLC_B0DLC0_MASK                                  0x1
#define _B0DLC_B0DLC1_POSN                                  0x1
#define _B0DLC_B0DLC1_POSITION                              0x1
#define _B0DLC_B0DLC1_SIZE                                  0x1
#define _B0DLC_B0DLC1_LENGTH                                0x1
#define _B0DLC_B0DLC1_MASK                                  0x2
#define _B0DLC_B0DLC2_POSN                                  0x2
#define _B0DLC_B0DLC2_POSITION                              0x2
#define _B0DLC_B0DLC2_SIZE                                  0x1
#define _B0DLC_B0DLC2_LENGTH                                0x1
#define _B0DLC_B0DLC2_MASK                                  0x4
#define _B0DLC_B0DLC3_POSN                                  0x3
#define _B0DLC_B0DLC3_POSITION                              0x3
#define _B0DLC_B0DLC3_SIZE                                  0x1
#define _B0DLC_B0DLC3_LENGTH                                0x1
#define _B0DLC_B0DLC3_MASK                                  0x8
#define _B0DLC_B0RB0_POSN                                   0x4
#define _B0DLC_B0RB0_POSITION                               0x4
#define _B0DLC_B0RB0_SIZE                                   0x1
#define _B0DLC_B0RB0_LENGTH                                 0x1
#define _B0DLC_B0RB0_MASK                                   0x10
#define _B0DLC_B0RB1_POSN                                   0x5
#define _B0DLC_B0RB1_POSITION                               0x5
#define _B0DLC_B0RB1_SIZE                                   0x1
#define _B0DLC_B0RB1_LENGTH                                 0x1
#define _B0DLC_B0RB1_MASK                                   0x20
#define _B0DLC_B0RXRTR_POSN                                 0x6
#define _B0DLC_B0RXRTR_POSITION                             0x6
#define _B0DLC_B0RXRTR_SIZE                                 0x1
#define _B0DLC_B0RXRTR_LENGTH                               0x1
#define _B0DLC_B0RXRTR_MASK                                 0x40

// Register: B0D0
#define B0D0 B0D0
extern volatile unsigned char           B0D0                __at(0xE26);
#ifndef _LIB_BUILD
asm("B0D0 equ 0E26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D00                  :1;
        unsigned B0D01                  :1;
        unsigned B0D02                  :1;
        unsigned B0D03                  :1;
        unsigned B0D04                  :1;
        unsigned B0D05                  :1;
        unsigned B0D06                  :1;
        unsigned B0D07                  :1;
    };
} B0D0bits_t;
extern volatile B0D0bits_t B0D0bits __at(0xE26);
// bitfield macros
#define _B0D0_B0D00_POSN                                    0x0
#define _B0D0_B0D00_POSITION                                0x0
#define _B0D0_B0D00_SIZE                                    0x1
#define _B0D0_B0D00_LENGTH                                  0x1
#define _B0D0_B0D00_MASK                                    0x1
#define _B0D0_B0D01_POSN                                    0x1
#define _B0D0_B0D01_POSITION                                0x1
#define _B0D0_B0D01_SIZE                                    0x1
#define _B0D0_B0D01_LENGTH                                  0x1
#define _B0D0_B0D01_MASK                                    0x2
#define _B0D0_B0D02_POSN                                    0x2
#define _B0D0_B0D02_POSITION                                0x2
#define _B0D0_B0D02_SIZE                                    0x1
#define _B0D0_B0D02_LENGTH                                  0x1
#define _B0D0_B0D02_MASK                                    0x4
#define _B0D0_B0D03_POSN                                    0x3
#define _B0D0_B0D03_POSITION                                0x3
#define _B0D0_B0D03_SIZE                                    0x1
#define _B0D0_B0D03_LENGTH                                  0x1
#define _B0D0_B0D03_MASK                                    0x8
#define _B0D0_B0D04_POSN                                    0x4
#define _B0D0_B0D04_POSITION                                0x4
#define _B0D0_B0D04_SIZE                                    0x1
#define _B0D0_B0D04_LENGTH                                  0x1
#define _B0D0_B0D04_MASK                                    0x10
#define _B0D0_B0D05_POSN                                    0x5
#define _B0D0_B0D05_POSITION                                0x5
#define _B0D0_B0D05_SIZE                                    0x1
#define _B0D0_B0D05_LENGTH                                  0x1
#define _B0D0_B0D05_MASK                                    0x20
#define _B0D0_B0D06_POSN                                    0x6
#define _B0D0_B0D06_POSITION                                0x6
#define _B0D0_B0D06_SIZE                                    0x1
#define _B0D0_B0D06_LENGTH                                  0x1
#define _B0D0_B0D06_MASK                                    0x40
#define _B0D0_B0D07_POSN                                    0x7
#define _B0D0_B0D07_POSITION                                0x7
#define _B0D0_B0D07_SIZE                                    0x1
#define _B0D0_B0D07_LENGTH                                  0x1
#define _B0D0_B0D07_MASK                                    0x80

// Register: B0D1
#define B0D1 B0D1
extern volatile unsigned char           B0D1                __at(0xE27);
#ifndef _LIB_BUILD
asm("B0D1 equ 0E27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D10                  :1;
        unsigned B0D11                  :1;
        unsigned B0D12                  :1;
        unsigned B0D13                  :1;
        unsigned B0D14                  :1;
        unsigned B0D15                  :1;
        unsigned B0D16                  :1;
        unsigned B0D17                  :1;
    };
} B0D1bits_t;
extern volatile B0D1bits_t B0D1bits __at(0xE27);
// bitfield macros
#define _B0D1_B0D10_POSN                                    0x0
#define _B0D1_B0D10_POSITION                                0x0
#define _B0D1_B0D10_SIZE                                    0x1
#define _B0D1_B0D10_LENGTH                                  0x1
#define _B0D1_B0D10_MASK                                    0x1
#define _B0D1_B0D11_POSN                                    0x1
#define _B0D1_B0D11_POSITION                                0x1
#define _B0D1_B0D11_SIZE                                    0x1
#define _B0D1_B0D11_LENGTH                                  0x1
#define _B0D1_B0D11_MASK                                    0x2
#define _B0D1_B0D12_POSN                                    0x2
#define _B0D1_B0D12_POSITION                                0x2
#define _B0D1_B0D12_SIZE                                    0x1
#define _B0D1_B0D12_LENGTH                                  0x1
#define _B0D1_B0D12_MASK                                    0x4
#define _B0D1_B0D13_POSN                                    0x3
#define _B0D1_B0D13_POSITION                                0x3
#define _B0D1_B0D13_SIZE                                    0x1
#define _B0D1_B0D13_LENGTH                                  0x1
#define _B0D1_B0D13_MASK                                    0x8
#define _B0D1_B0D14_POSN                                    0x4
#define _B0D1_B0D14_POSITION                                0x4
#define _B0D1_B0D14_SIZE                                    0x1
#define _B0D1_B0D14_LENGTH                                  0x1
#define _B0D1_B0D14_MASK                                    0x10
#define _B0D1_B0D15_POSN                                    0x5
#define _B0D1_B0D15_POSITION                                0x5
#define _B0D1_B0D15_SIZE                                    0x1
#define _B0D1_B0D15_LENGTH                                  0x1
#define _B0D1_B0D15_MASK                                    0x20
#define _B0D1_B0D16_POSN                                    0x6
#define _B0D1_B0D16_POSITION                                0x6
#define _B0D1_B0D16_SIZE                                    0x1
#define _B0D1_B0D16_LENGTH                                  0x1
#define _B0D1_B0D16_MASK                                    0x40
#define _B0D1_B0D17_POSN                                    0x7
#define _B0D1_B0D17_POSITION                                0x7
#define _B0D1_B0D17_SIZE                                    0x1
#define _B0D1_B0D17_LENGTH                                  0x1
#define _B0D1_B0D17_MASK                                    0x80

// Register: B0D2
#define B0D2 B0D2
extern volatile unsigned char           B0D2                __at(0xE28);
#ifndef _LIB_BUILD
asm("B0D2 equ 0E28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B0D20                  :1;
        unsigned B0D21                  :1;
        unsigned B0D22                  :1;
        unsigned B0D23                  :1;
        unsigned B0D24                  :1;
        unsigned B0D25                  :1;
        unsigned B0D26                  :1;
        unsigned B0D27                  :1;
    };
} B0D2bits_t;
