MikroElektronika/core_packages/PIC/XC8/def/PIC18F2580/mcu.h
extern volatile CANSTAT_RO4bits_t CANSTAT_RO4bits __at(0xE7E);
// bitfield macros
#define _CANSTAT_RO4_EICODE0_POSN                           0x0
#define _CANSTAT_RO4_EICODE0_POSITION                       0x0
#define _CANSTAT_RO4_EICODE0_SIZE                           0x1
#define _CANSTAT_RO4_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO4_EICODE0_MASK                           0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO4_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO4_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO4_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO4_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO4_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO4_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO4_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO4_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO4_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO4_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO4_EICODE4_POSN                           0x4
#define _CANSTAT_RO4_EICODE4_POSITION                       0x4
#define _CANSTAT_RO4_EICODE4_SIZE                           0x1
#define _CANSTAT_RO4_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO4_EICODE4_MASK                           0x10
#define _CANSTAT_RO4_OPMODE0_POSN                           0x5
#define _CANSTAT_RO4_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO4_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO4_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO4_OPMODE0_MASK                           0x20
#define _CANSTAT_RO4_OPMODE1_POSN                           0x6
#define _CANSTAT_RO4_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO4_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO4_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO4_OPMODE1_MASK                           0x40
#define _CANSTAT_RO4_OPMODE2_POSN                           0x7
#define _CANSTAT_RO4_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO4_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO4_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO4_OPMODE2_MASK                           0x80
#define _CANSTAT_RO4_ICODE0_POSN                            0x0
#define _CANSTAT_RO4_ICODE0_POSITION                        0x0
#define _CANSTAT_RO4_ICODE0_SIZE                            0x1
#define _CANSTAT_RO4_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE0_MASK                            0x1
#define _CANSTAT_RO4_ICODE1_POSN                            0x1
#define _CANSTAT_RO4_ICODE1_POSITION                        0x1
#define _CANSTAT_RO4_ICODE1_SIZE                            0x1
#define _CANSTAT_RO4_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE1_MASK                            0x2
#define _CANSTAT_RO4_ICODE2_POSN                            0x2
#define _CANSTAT_RO4_ICODE2_POSITION                        0x2
#define _CANSTAT_RO4_ICODE2_SIZE                            0x1
#define _CANSTAT_RO4_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE2_MASK                            0x4
#define _CANSTAT_RO4_ICODE3_POSN                            0x3
#define _CANSTAT_RO4_ICODE3_POSITION                        0x3
#define _CANSTAT_RO4_ICODE3_SIZE                            0x1
#define _CANSTAT_RO4_ICODE3_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE3_MASK                            0x8
#define _CANSTAT_RO4_ICODE4_POSN                            0x4
#define _CANSTAT_RO4_ICODE4_POSITION                        0x4
#define _CANSTAT_RO4_ICODE4_SIZE                            0x1
#define _CANSTAT_RO4_ICODE4_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE4_MASK                            0x10

// Register: CANCON_RO4
#define CANCON_RO4 CANCON_RO4
extern volatile unsigned char           CANCON_RO4          __at(0xE7F);
#ifndef _LIB_BUILD
asm("CANCON_RO4 equ 0E7Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP0                 :1;
        unsigned REQOP1                 :1;
        unsigned REQOP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
} CANCON_RO4bits_t;
extern volatile CANCON_RO4bits_t CANCON_RO4bits __at(0xE7F);
// bitfield macros
#define _CANCON_RO4_FP0_POSN                                0x0
#define _CANCON_RO4_FP0_POSITION                            0x0
#define _CANCON_RO4_FP0_SIZE                                0x1
#define _CANCON_RO4_FP0_LENGTH                              0x1
#define _CANCON_RO4_FP0_MASK                                0x1
#define _CANCON_RO4_WIN0_FP1_POSN                           0x1
#define _CANCON_RO4_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO4_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO4_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO4_WIN0_FP1_MASK                           0x2
#define _CANCON_RO4_WIN1_FP2_POSN                           0x2
#define _CANCON_RO4_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO4_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO4_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO4_WIN1_FP2_MASK                           0x4
#define _CANCON_RO4_WIN2_FP3_POSN                           0x3
#define _CANCON_RO4_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO4_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO4_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO4_WIN2_FP3_MASK                           0x8
#define _CANCON_RO4_ABAT_POSN                               0x4
#define _CANCON_RO4_ABAT_POSITION                           0x4
#define _CANCON_RO4_ABAT_SIZE                               0x1
#define _CANCON_RO4_ABAT_LENGTH                             0x1
#define _CANCON_RO4_ABAT_MASK                               0x10
#define _CANCON_RO4_REQOP0_POSN                             0x5
#define _CANCON_RO4_REQOP0_POSITION                         0x5
#define _CANCON_RO4_REQOP0_SIZE                             0x1
#define _CANCON_RO4_REQOP0_LENGTH                           0x1
#define _CANCON_RO4_REQOP0_MASK                             0x20
#define _CANCON_RO4_REQOP1_POSN                             0x6
#define _CANCON_RO4_REQOP1_POSITION                         0x6
#define _CANCON_RO4_REQOP1_SIZE                             0x1
#define _CANCON_RO4_REQOP1_LENGTH                           0x1
#define _CANCON_RO4_REQOP1_MASK                             0x40
#define _CANCON_RO4_REQOP2_POSN                             0x7
#define _CANCON_RO4_REQOP2_POSITION                         0x7
#define _CANCON_RO4_REQOP2_SIZE                             0x1
#define _CANCON_RO4_REQOP2_LENGTH                           0x1
#define _CANCON_RO4_REQOP2_MASK                             0x80
#define _CANCON_RO4_WIN0_POSN                               0x1
#define _CANCON_RO4_WIN0_POSITION                           0x1
#define _CANCON_RO4_WIN0_SIZE                               0x1
#define _CANCON_RO4_WIN0_LENGTH                             0x1
#define _CANCON_RO4_WIN0_MASK                               0x2
#define _CANCON_RO4_WIN1_POSN                               0x2
#define _CANCON_RO4_WIN1_POSITION                           0x2
#define _CANCON_RO4_WIN1_SIZE                               0x1
#define _CANCON_RO4_WIN1_LENGTH                             0x1
#define _CANCON_RO4_WIN1_MASK                               0x4
#define _CANCON_RO4_WIN2_POSN                               0x3
#define _CANCON_RO4_WIN2_POSITION                           0x3
#define _CANCON_RO4_WIN2_SIZE                               0x1
#define _CANCON_RO4_WIN2_LENGTH                             0x1
#define _CANCON_RO4_WIN2_MASK                               0x8

