MikroElektronika/core_packages/PIC/XC8/def/PIC18F2580/mcu.h
// Register: CANSTAT_RO1
#define CANSTAT_RO1 CANSTAT_RO1
extern volatile unsigned char           CANSTAT_RO1         __at(0xF4E);
#ifndef _LIB_BUILD
asm("CANSTAT_RO1 equ 0F4Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
        unsigned ICODE3                 :1;
        unsigned ICODE4                 :1;
    };
} CANSTAT_RO1bits_t;
extern volatile CANSTAT_RO1bits_t CANSTAT_RO1bits __at(0xF4E);
// bitfield macros
#define _CANSTAT_RO1_EICODE0_POSN                           0x0
#define _CANSTAT_RO1_EICODE0_POSITION                       0x0
#define _CANSTAT_RO1_EICODE0_SIZE                           0x1
#define _CANSTAT_RO1_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO1_EICODE0_MASK                           0x1
#define _CANSTAT_RO1_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO1_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO1_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO1_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO1_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO1_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO1_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO1_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO1_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO1_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO1_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO1_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO1_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO1_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO1_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO1_EICODE4_POSN                           0x4
#define _CANSTAT_RO1_EICODE4_POSITION                       0x4
#define _CANSTAT_RO1_EICODE4_SIZE                           0x1
#define _CANSTAT_RO1_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO1_EICODE4_MASK                           0x10
#define _CANSTAT_RO1_OPMODE0_POSN                           0x5
#define _CANSTAT_RO1_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO1_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO1_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO1_OPMODE0_MASK                           0x20
#define _CANSTAT_RO1_OPMODE1_POSN                           0x6
#define _CANSTAT_RO1_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO1_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO1_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO1_OPMODE1_MASK                           0x40
#define _CANSTAT_RO1_OPMODE2_POSN                           0x7
#define _CANSTAT_RO1_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO1_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO1_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO1_OPMODE2_MASK                           0x80
#define _CANSTAT_RO1_ICODE0_POSN                            0x0
#define _CANSTAT_RO1_ICODE0_POSITION                        0x0
#define _CANSTAT_RO1_ICODE0_SIZE                            0x1
#define _CANSTAT_RO1_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO1_ICODE0_MASK                            0x1
#define _CANSTAT_RO1_ICODE1_POSN                            0x1
#define _CANSTAT_RO1_ICODE1_POSITION                        0x1
#define _CANSTAT_RO1_ICODE1_SIZE                            0x1
#define _CANSTAT_RO1_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO1_ICODE1_MASK                            0x2
#define _CANSTAT_RO1_ICODE2_POSN                            0x2
#define _CANSTAT_RO1_ICODE2_POSITION                        0x2
#define _CANSTAT_RO1_ICODE2_SIZE                            0x1
#define _CANSTAT_RO1_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO1_ICODE2_MASK                            0x4
#define _CANSTAT_RO1_ICODE3_POSN                            0x3
#define _CANSTAT_RO1_ICODE3_POSITION                        0x3
#define _CANSTAT_RO1_ICODE3_SIZE                            0x1
#define _CANSTAT_RO1_ICODE3_LENGTH                          0x1
#define _CANSTAT_RO1_ICODE3_MASK                            0x8
#define _CANSTAT_RO1_ICODE4_POSN                            0x4
#define _CANSTAT_RO1_ICODE4_POSITION                        0x4
#define _CANSTAT_RO1_ICODE4_SIZE                            0x1
#define _CANSTAT_RO1_ICODE4_LENGTH                          0x1
#define _CANSTAT_RO1_ICODE4_MASK                            0x10

// Register: CANCON_RO1
#define CANCON_RO1 CANCON_RO1
extern volatile unsigned char           CANCON_RO1          __at(0xF4F);
#ifndef _LIB_BUILD
asm("CANCON_RO1 equ 0F4Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP0                 :1;
        unsigned REQOP1                 :1;
        unsigned REQOP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
} CANCON_RO1bits_t;
extern volatile CANCON_RO1bits_t CANCON_RO1bits __at(0xF4F);
// bitfield macros
#define _CANCON_RO1_FP0_POSN                                0x0
#define _CANCON_RO1_FP0_POSITION                            0x0
#define _CANCON_RO1_FP0_SIZE                                0x1
#define _CANCON_RO1_FP0_LENGTH                              0x1
#define _CANCON_RO1_FP0_MASK                                0x1
#define _CANCON_RO1_WIN0_FP1_POSN                           0x1
#define _CANCON_RO1_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO1_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO1_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO1_WIN0_FP1_MASK                           0x2
#define _CANCON_RO1_WIN1_FP2_POSN                           0x2
#define _CANCON_RO1_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO1_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO1_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO1_WIN1_FP2_MASK                           0x4
#define _CANCON_RO1_WIN2_FP3_POSN                           0x3
#define _CANCON_RO1_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO1_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO1_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO1_WIN2_FP3_MASK                           0x8
#define _CANCON_RO1_ABAT_POSN                               0x4
#define _CANCON_RO1_ABAT_POSITION                           0x4
#define _CANCON_RO1_ABAT_SIZE                               0x1
#define _CANCON_RO1_ABAT_LENGTH                             0x1
#define _CANCON_RO1_ABAT_MASK                               0x10
#define _CANCON_RO1_REQOP0_POSN                             0x5
#define _CANCON_RO1_REQOP0_POSITION                         0x5
#define _CANCON_RO1_REQOP0_SIZE                             0x1
#define _CANCON_RO1_REQOP0_LENGTH                           0x1
#define _CANCON_RO1_REQOP0_MASK                             0x20
#define _CANCON_RO1_REQOP1_POSN                             0x6
#define _CANCON_RO1_REQOP1_POSITION                         0x6
#define _CANCON_RO1_REQOP1_SIZE                             0x1
#define _CANCON_RO1_REQOP1_LENGTH                           0x1
#define _CANCON_RO1_REQOP1_MASK                             0x40
#define _CANCON_RO1_REQOP2_POSN                             0x7
#define _CANCON_RO1_REQOP2_POSITION                         0x7
#define _CANCON_RO1_REQOP2_SIZE                             0x1
#define _CANCON_RO1_REQOP2_LENGTH                           0x1
#define _CANCON_RO1_REQOP2_MASK                             0x80
#define _CANCON_RO1_WIN0_POSN                               0x1
#define _CANCON_RO1_WIN0_POSITION                           0x1
#define _CANCON_RO1_WIN0_SIZE                               0x1
#define _CANCON_RO1_WIN0_LENGTH                             0x1
#define _CANCON_RO1_WIN0_MASK                               0x2
#define _CANCON_RO1_WIN1_POSN                               0x2
#define _CANCON_RO1_WIN1_POSITION                           0x2
#define _CANCON_RO1_WIN1_SIZE                               0x1
#define _CANCON_RO1_WIN1_LENGTH                             0x1
#define _CANCON_RO1_WIN1_MASK                               0x4
#define _CANCON_RO1_WIN2_POSN                               0x3
#define _CANCON_RO1_WIN2_POSITION                           0x3
#define _CANCON_RO1_WIN2_SIZE                               0x1
#define _CANCON_RO1_WIN2_LENGTH                             0x1
#define _CANCON_RO1_WIN2_MASK                               0x8

// Register: RXB1CON
#define RXB1CON RXB1CON
extern volatile unsigned char           RXB1CON             __at(0xF50);
#ifndef _LIB_BUILD
asm("RXB1CON equ 0F50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0                :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned RXRTRRO_FILHIT3        :1;
        unsigned FILHIT4                :1;
        unsigned RXM0_RTRRO             :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned RXRTRRO                :1;
        unsigned                        :1;
        unsigned RXM0                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned FILHIT3                :1;
        unsigned                        :1;
        unsigned RTRRO                  :1;
    };
    struct {
        unsigned RXB1FILHIT0            :1;
        unsigned RXB1FILHIT1            :1;
        unsigned RXB1FILHIT2            :1;
        unsigned RXB1FILHIT3            :1;
        unsigned RXB1FILHIT4            :1;
        unsigned RXB1M0                 :1;
        unsigned RXB1M1                 :1;
        unsigned RXB1FUL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RXB1RTRR0              :1;
        unsigned                        :1;
        unsigned RXB1RTRRO              :1;
    };
} RXB1CONbits_t;
